/*
                                                                  * CVI DRAFT *
    POS - Practice-Oriented Structure (System)                        Version 1
    ---------------------------------------------------------------------------
                                Power Of the Software !

    License:    POS.LCL
    See Also:   X@A LaS PoX EPFS HFVC 1/bios HAS/HAD Aipos

    Ci Virtuality Integrated,
    Copyright 1997-2003, CHINA. All rights reserved.

    File:
        Module Name:    _________________________
        Description:    ___________________________________________________
                        ___________________________________________________
        Version:        0.0.1
        Author:         (ZD) ZAUJ G.DANSEI
    History:
        2003-MM-DD      ZD|started
        2003-MM-DD
    ---------------------------------------------------------------------------
                                                                  * CVI DRAFT *
*/



#ifndef __MODULE_INCLUDED__
#define __MODULE_INCLUDED__
#ifdef POS_CF_ONCE
#   pragma once
#endif

#include "config.h"



///////////////////////////////////////////////////////////////////////////////
//
// Forward Declaration, Macros and Constants
// ----------------------------------------------------------------------------
POS_BEGIN

POS_END



// Header files to use
#include "variant.h"
#include "error.h"

///////////////////////////////////////////////////////////////////////////////
//
// Prototypes
// ----------------------------------------------------------------------------
#include "config/alignment_begin.h"
POS_BEGIN




















POS_END
#include "config/alignment_end.h"



///////////////////////////////////////////////////////////////////////////////
//
// Inline implementations & Utility functions
// ----------------------------------------------------------------------------
POS_BEGIN

POS_END

#endif



///////////////////////////////////////////////////////////////////////////////
//
// The Developing Procedure
// ----------------------------------------------------------------------------
/*
        Summary:
                _____________________________________________
                _____________________________________________
        Motivation:
                ___________________________________________________________
        Objective:
                ___________________________________________
                ___________________________________________
                ___________________________________________
        Sandbox, Problems, Warnings:
                - How constraints affect each other?
                _______________________________________
                _______________________________________
                _______________________________________
        Development:
                * 空间形式，继承geometry_t结构?
                    - 坐标系，父空间；
                        . bOverflow     溢出父空间
                    - 形状，以矩形为主
                        . 被动因子: 形状的顶点和边活动属性，活动优先级
                    - 空间作为容器，它的本质存储体和用户体
                        . pContent
                        . pUser
                    - 互动描述，一个空间对另一个空间施加影响
                        . 空间体的主动因子
                            (以后凡是整个独立控件体的用主动因子，而定点和边则用被动因子)
                        . 可以描述的特性：
                            主动结合性，两个空间自动结合、或者粘合在一起；
                            占据性，一个主动因子高的空间将对所覆盖的空间施加形状影响，
                                (表现为赋予被动空间一个修改了的父空间，修改一般是收缩。)
                    -
                ___________________________________________________________
                ___________________________________________________________
        References:
                _________________________________________________
        Achievement:
                ________________________________________
        Outgrowth & Babies, Abbreviations:
                _____________________________
                _____________________________
                _____________________________
        Acknowledgement:
                _____________________________________________
*/
